{"class_name": "Model", "keras_version": "2.1.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "int32", "batch_input_shape": [null, 36], "name": "input_9", "sparse": false}, "inbound_nodes": [], "name": "input_9"}, {"class_name": "InputLayer", "config": {"dtype": "int32", "batch_input_shape": [null, 36], "name": "input_10", "sparse": false}, "inbound_nodes": [], "name": "input_10"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_1", "dtype": "float32", "output_dim": 300, "trainable": true, "embeddings_regularizer": null, "input_dim": 91731, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 36], "activity_regularizer": null, "input_length": 36}, "inbound_nodes": [[["input_9", 0, 0, {}]], [["input_10", 0, 0, {}]]], "name": "embedding_1"}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "lstm_5", "bias_constraint": null, "go_backwards": false, "implementation": 1, "kernel_regularizer": null, "return_sequences": false, "recurrent_constraint": null}, "inbound_nodes": [[["embedding_1", 0, 0, {}]], [["embedding_1", 1, 0, {}]]], "name": "lstm_5"}, {"class_name": "Subtract", "config": {"trainable": true, "name": "subtract_1"}, "inbound_nodes": [[["lstm_5", 0, 0, {}], ["lstm_5", 1, 0, {}]]], "name": "subtract_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_13", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["subtract_1", 0, 0, {}]]], "name": "batch_normalization_13"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_13", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "name": "dense_13"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_14", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["dense_13", 0, 0, {}]]], "name": "batch_normalization_14"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_14", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "dense_14"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_15", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["dense_14", 0, 0, {}]]], "name": "batch_normalization_15"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_15", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "name": "dense_15"}], "input_layers": [["input_9", 0, 0], ["input_10", 0, 0]], "output_layers": [["dense_15", 0, 0]], "name": "model_5"}, "backend": "tensorflow"}