{"class_name": "Model", "keras_version": "2.0.8", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "int32", "batch_input_shape": [null, 36], "name": "input_18", "sparse": false}, "inbound_nodes": [], "name": "input_18"}, {"class_name": "InputLayer", "config": {"dtype": "int32", "batch_input_shape": [null, 36], "name": "input_19", "sparse": false}, "inbound_nodes": [], "name": "input_19"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_5", "dtype": "float32", "output_dim": 300, "trainable": true, "embeddings_regularizer": null, "input_dim": 91731, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 36], "activity_regularizer": null, "input_length": 36}, "inbound_nodes": [[["input_18", 0, 0, {}]], [["input_19", 0, 0, {}]]], "name": "embedding_5"}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.2, "stateful": false, "recurrent_regularizer": null, "name": "lstm_10", "bias_constraint": null, "go_backwards": false, "implementation": 0, "kernel_regularizer": null, "return_sequences": false, "recurrent_constraint": null}, "inbound_nodes": [[["embedding_5", 0, 0, {}]], [["embedding_5", 1, 0, {}]]], "name": "lstm_10"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_9", "axis": -1}, "inbound_nodes": [[["lstm_10", 0, 0, {}], ["lstm_10", 1, 0, {}]]], "name": "concatenate_9"}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_25"}, "inbound_nodes": [[["concatenate_9", 0, 0, {}]]], "name": "dropout_25"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_25", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["dropout_25", 0, 0, {}]]], "name": "batch_normalization_25"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_25", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "name": "dense_25"}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_26"}, "inbound_nodes": [[["dense_25", 0, 0, {}]]], "name": "dropout_26"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_26", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["dropout_26", 0, 0, {}]]], "name": "batch_normalization_26"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_26", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "name": "dense_26"}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_27"}, "inbound_nodes": [[["dense_26", 0, 0, {}]]], "name": "dropout_27"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_27", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["dropout_27", 0, 0, {}]]], "name": "batch_normalization_27"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_27", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "name": "dense_27"}], "input_layers": [["input_18", 0, 0], ["input_19", 0, 0]], "output_layers": [["dense_27", 0, 0]], "name": "model_9"}, "backend": "tensorflow"}