{"class_name": "Model", "keras_version": "2.0.8", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "int32", "batch_input_shape": [null, 30], "name": "input_17", "sparse": false}, "inbound_nodes": [], "name": "input_17"}, {"class_name": "InputLayer", "config": {"dtype": "int32", "batch_input_shape": [null, 30], "name": "input_18", "sparse": false}, "inbound_nodes": [], "name": "input_18"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_3", "dtype": "float32", "output_dim": 300, "trainable": false, "embeddings_regularizer": null, "input_dim": 95603, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 30], "activity_regularizer": null, "input_length": 30}, "inbound_nodes": [[["input_17", 0, 0, {}]], [["input_18", 0, 0, {}]]], "name": "embedding_3"}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 265, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.39180150531436975, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.39180150531436975, "stateful": false, "recurrent_regularizer": null, "name": "lstm_10", "bias_constraint": null, "go_backwards": false, "implementation": 0, "kernel_regularizer": null, "return_sequences": false, "recurrent_constraint": null}, "inbound_nodes": [[["embedding_3", 0, 0, {}]], [["embedding_3", 1, 0, {}]]], "name": "lstm_10"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_8", "axis": -1}, "inbound_nodes": [[["lstm_10", 0, 0, {}], ["lstm_10", 1, 0, {}]]], "name": "concatenate_8"}, {"class_name": "Dropout", "config": {"rate": 0.17056741703770315, "trainable": true, "name": "dropout_20"}, "inbound_nodes": [[["concatenate_8", 0, 0, {}]]], "name": "dropout_20"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_20", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["dropout_20", 0, 0, {}]]], "name": "batch_normalization_20"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_20", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 142, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "name": "dense_20"}, {"class_name": "Dropout", "config": {"rate": 0.17056741703770315, "trainable": true, "name": "dropout_21"}, "inbound_nodes": [[["dense_20", 0, 0, {}]]], "name": "dropout_21"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_21", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["dropout_21", 0, 0, {}]]], "name": "batch_normalization_21"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_21", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 142, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "name": "dense_21"}, {"class_name": "Dropout", "config": {"rate": 0.17056741703770315, "trainable": true, "name": "dropout_22"}, "inbound_nodes": [[["dense_21", 0, 0, {}]]], "name": "dropout_22"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_22", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["dropout_22", 0, 0, {}]]], "name": "batch_normalization_22"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_22", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "name": "dense_22"}], "input_layers": [["input_17", 0, 0], ["input_18", 0, 0]], "output_layers": [["dense_22", 0, 0]], "name": "model_8"}, "backend": "tensorflow"}